Revit 2026 API

# IViewSheetSet Interface

---

This interface represents a selected set of views/sheets which will be used for printing.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IViewSheetSet
```
```vb
Public Interface IViewSheetSet
```
```cpp
public interface class IViewSheetSet
```
```fsharp
type IViewSheetSet = interface end
```

The IViewSheetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsAutomatic | Automatic order or manual order. |
|  | OrderedViewList | Ordered views. |
|  | SheetOrganizationId | ElementId to the BrowserOrganization for sheets. |
|  | ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views. |
|  | Views | The views. |

#### Reference

Autodesk.Revit.DB Namespace